In [1]:
import pandas as pd

In [2]:
product = pd.read_csv('Импортируемые начальные csv и xlsx HW2/product.csv')
product.head()

,product_id,brand,product_line,product_class,product_size,list_price,standard_cost
0,14,Trek Bicycles,Standard,medium,small,1386.84,1234.29
1,28,Norco Bicycles,Standard,medium,small,1216.14,1082.36
2,0,Solex,Standard,medium,medium,71.49,53.62
3,5,Giant Bicycles,Standard,high,medium,1129.13,677.48
4,22,WeareA2B,Standard,medium,medium,60.34,45.26

In [3]:
product.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 190 entries, 0 to 189
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   product_id     190 non-null    int64
 1   brand          189 non-null    object
 2   product_line   189 non-null    object
 3   product_class  189 non-null    object
 4   product_size   189 non-null    object
 5   list_price     190 non-null    float64
 6   standard_cost  189 non-null    float64
dtypes: float64(2), int64(1), object(4)
memory usage: 10.5+ KB

In [4]:
product.describe()

       product_id   list_price  standard_cost
count  190.000000   190.000000     189.000000
mean    45.547368  1090.289000     562.938730
std     31.975443   577.455451     417.216593
min      0.000000    12.010000       7.210000
25%     17.000000   587.402500     215.030000
50%     44.500000  1150.300000     513.850000
75%     73.750000  1555.580000     795.100000
max    100.000000  2091.470000    1759.850000

In [5]:
product.nunique()

product_id       101
brand              6
product_line       4
product_class      3
product_size       3
list_price       101
standard_cost    100
dtype: int64

In [6]:
customer = pd.read_csv('Импортируемые начальные csv и xlsx HW2/customer.csv', sep = ';')
customer.head()

,customer_id,first_name,last_name,gender,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,address,postcode,state,country,property_valuation
0,1,Laraine,Medendorp,F,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,Eli,Bockman,Male,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,3,Arlin,Dearle,Male,1954-01-20,Recruiting Manager,Property,Mass Customer,N,Yes,0 Holy Cross Court,4211,QLD,Australia,9
3,4,Talbot,NaN,Male,1961-10-03,NaN,IT,Mass Customer,N,No,17979 Del Mar Point,2448,New South Wales,Australia,4
4,5,Sheila-kathryn,Calton,Female,1977-05-13,Senior Editor,NaN,Affluent Customer,N,Yes,9 Oakridge Court,3216,VIC,Australia,9

In [7]:
customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 15 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   customer_id            4000 non-null   int64
 1   first_name             4000 non-null   object
 2   last_name              3875 non-null   object
 3   gender                 4000 non-null   object
 4   DOB                    3913 non-null   object
 5   job_title              3494 non-null   object
 6   job_industry_category  3344 non-null   object
 7   wealth_segment         4000 non-null   object
 8   deceased_indicator     4000 non-null   object
 9   owns_car               4000 non-null   object
 10  address                4000 non-null   object
 11  postcode               4000 non-null   int64
 12  state                  4000 non-null   object
 13  country                4000 non-null   object
 14  property_valuation     4000 non-null   int64
dtypes: int64(3), object(12)
memory usage: 468.9+ KB

In [8]:
customer.describe()

       customer_id     postcode  property_valuation
count  4000.000000  4000.000000         4000.000000
mean   2000.500000  2986.008500            7.515000
std    1154.844867   844.923724            2.824583
min       1.000000  2000.000000            1.000000
25%    1000.750000  2200.000000            6.000000
50%    2000.500000  2768.000000            8.000000
75%    3000.250000  3750.500000           10.000000
max    4000.000000  4883.000000           12.000000

In [9]:
customer.nunique()

customer_id              4000
first_name               3139
last_name                3725
gender                      6
DOB                      3448
job_title                 195
job_industry_category       9
wealth_segment              3
deceased_indicator          2
owns_car                    2
address                  3996
postcode                  874
state                       5
country                     1
property_valuation         12
dtype: int64

In [10]:
orders = pd.read_csv('Импортируемые начальные csv и xlsx HW2/orders.csv')
orders.head()

   order_id  customer_id  order_date online_order order_status
0         1         2950  2017-02-25        False     Approved
1         2         3120  2017-05-21         True     Approved
2         3          402  2017-10-16        False     Approved
3         4         3135  2017-08-31        False     Approved
4         5          787  2017-10-01         True     Approved

In [11]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   order_id      20000 non-null  int64
 1   customer_id   20000 non-null  int64
 2   order_date    20000 non-null  object
 3   online_order  19640 non-null  object
 4   order_status  20000 non-null  object
dtypes: int64(2), object(3)
memory usage: 781.4+ KB

In [12]:
orders.describe()

           order_id   customer_id
count  20000.000000  20000.000000
mean   10000.500000   1738.246050
std     5773.647028   1011.951046
min        1.000000      1.000000
25%     5000.750000    857.750000
50%    10000.500000   1736.000000
75%    15000.250000   2613.000000
max    20000.000000   5034.000000

In [13]:
orders.nunique()

order_id        20000
customer_id      3494
order_date        364
online_order        2
order_status        2
dtype: int64

In [14]:
order_items = pd.read_csv('Импортируемые начальные csv и xlsx HW2/order_items.csv')
order_items.head()

,order_item_id,order_id,product_id,quantity,item_list_price_at_sale,item_standard_cost_at_sale
0,1,1,2,6.0,71.49,53.62
1,2,2,3,2.0,2091.47,388.92
2,3,3,37,7.0,1793.43,248.82
3,4,4,88,4.0,1198.46,381.10
4,5,5,78,7.0,1765.30,709.48

In [15]:
order_items.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 6 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   order_item_id               20000 non-null  int64
 1   order_id                    20000 non-null  int64
 2   product_id                  20000 non-null  int64
 3   quantity                    20000 non-null  float64
 4   item_list_price_at_sale     20000 non-null  float64
 5   item_standard_cost_at_sale  19803 non-null  float64
dtypes: float64(3), int64(3)
memory usage: 937.6 KB

In [16]:
order_items.describe()

,order_item_id,order_id,product_id,quantity,item_list_price_at_sale,item_standard_cost_at_sale
count,20000.000000,20000.000000,20000.00000,20000.000000,20000.000000,19803.000000
mean,10000.500000,10000.500000,45.36465,5.541650,1107.829449,556.046951
std,5773.647028,5773.647028,30.75359,2.877148,582.825242,405.955659
min,1.000000,1.000000,0.00000,1.000000,12.010000,7.210000
25%,5000.750000,5000.750000,18.00000,3.000000,575.270000,215.140000
50%,10000.500000,10000.500000,44.00000,6.000000,1163.890000,507.580000
75%,15000.250000,15000.250000,72.00000,8.000000,1635.300000,795.100000
max,20000.000000,20000.000000,100.00000,10.000000,2091.470000,1759.850000

In [17]:
order_items.nunique()

order_item_id                 20000
order_id                      20000
product_id                      101
quantity                         10
item_list_price_at_sale         296
item_standard_cost_at_sale      100
dtype: int64